src/26-lessons-from-being-a-developer-at-a-startup.org
#+title: 26 Lessons From Being a Developer at a Startup

[[https://blog.stephanbehnke.com/26-lessons-from-being-a-developer-at-a-startup/]]

作为创业公司的开发者学到的26点，整理的非常棒

** Retrospectives are crucial. 定期回顾
在讨论之前，每个人都需要先说说自己的看法，避免被"loudest"声音所淹没。

We regularly sat together as a team to reflect on the last iteration. The importance of looking back and evaluating cannot be overstated. Each participant was required to think about the things that went well and things that need improvement on their own first. The group discussion started only after everyone had presented their thoughts. This way, everyone was able to bring up important issues - much better than the kind of meetings where the 'loudest' dominate the conversation.

** Take the time for regular 1:1s. 定期1:1

In a busy startup environment it might be hard to justify just talking to your manager for an hour each week. But that is what we did and it worked brilliantly. You can discuss issues in-depth, timely and simply feel more valued as an employee. There is no replacement for that.

** Just pay for developer tools. 乐于为开发工具花钱
体现对开发人员的重视

For computers, every GB or MHz contributes to being able to work faster. For software, every useful tool that makes you more efficient counts. Giving the developer a fast, modern toolset also shows that the company values him/her. There should be no discussion about that. Period.

** Meet your customers. 见见客户

We visited our local customers regularly and had an annual company trip to customer hot spots (New York and San Francisco, for example). This made all the difference. It is one thing to exchange emails with customers, but it is a completely different experience to meet them and hear their pains and successes first hand. It has a powerful and lasting effect on the way you think about your users when you are back developing.

** Don't let the build become slow. 加快构建速度
加快构建速度可以提高反馈速度，提高开发效率。

You know you have acted too late when the slow build becomes a running gag in the office (XKCD anyone?). There is hardly anything more frustrating than having a slow feedback cycle. We have worked with Java in the backend and Webpack in the frontend. Both were getting slower and slower by the week. In the end, it made me want to smash my head against the wall. In the long run, slow builds cannot be fixed by buying faster machines. You need to think about the structure of your application to deal with it; modularising it, for example. There is no quick fix.

** Cross-functional teams FTW. 能力交叉团队更高效
把不同能力的人放在一起组成团队，的确能产生许多想象不到的效果。

Before we had formed cross-functional teams, we were only able to effectively tackle small projects. Once we had a team consisting of designer plus frontend and backend developer, things took off. It allowed us to work on much bigger, more impactful features. It brought its own set of challenges but overall it was a crucial step in the evolution of the startup.

** Trello does not scale well as a bug or project management tool. 工具定制化是不可避免的

We have used Trello to manage our bugs. I love Trello but I always felt it fell short. It was difficult to search and only scaled up to a certain point. The same goes for project management. At a certain point the simplicity and ease of use fade away and it just becomes too overwhelming and ineffective. I prefer dedicated tools that actually support and facilitate what you are trying to achieve.

** Take on responsibility or wither away. 承担责任
最后一句看上去有点像我现在的处境

To be successful at any company you need to take on responsibilities. The bigger the better. The difference to a corporate environment is that it is quite easy to do so: roles are not set in stone and it is easy to grab unclaimed or unwanted responsibilities. You must become the guy/gal for something to improve your standing. You need to be proactive and shape your own image - or others will do it for you. Bonus points if you align this with the company goals. *You can be a great code architect - but when the company only values feature development, you are betting on the wrong horse.*

** Adapt or leave... or fight if you need to. 适应，离开，或者是反抗

You might disagree with your management on certain things. In that case, you need to decide how important these issues are to you. If it is very important, you can take on the challenge and fight to stand up for what you believe is right. But often it will be an uphill battle. If hardly anyone around you supports you, or worse, does not even share your views, then you need to ask yourself if it is worth it. You can either ignore it and play along or look for another job.

** Look for benefits that actually matter. 关注最核心的利益
公司的福利不是最核心的利益，公司的快速成长才是。当然每个人是有自己的情况的，要尊重差别。

A lot of startups boast with heaps of benefits. Some take pride in their ping pong tables, some want to impress with an open bar on Friday nights and some show off their selection of high-fructose corn syrup candy. It's a trap! Look for meaningful benefits like lunch and learns, an education budget or health benefits.

** The CEO should be able to take a vacation. CEO休假离开时公司依然可以运转
整个公司指望一个或者是几个人的话，是非常危险的。

When a startup is growing, the CEO has to give up more and more responsibilities since a single person cannot scale along with it. Basically, the CEO has to replace himself/herself step by step. A good indicator if this is working out is him/her deciding to go on a vacation.

