html/26-lessons-from-being-a-developer-at-a-startup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>26 Lessons From Being a Developer at a Startup</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">26 Lessons From Being a Developer at a Startup</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Retrospectives are crucial. 定期回顾</a></li>
<li><a href="#sec-2">2. Take the time for regular 1:1s. 定期1:1</a></li>
<li><a href="#sec-3">3. Just pay for developer tools. 乐于为开发工具花钱</a></li>
<li><a href="#sec-4">4. Meet your customers. 见见客户</a></li>
<li><a href="#sec-5">5. Don't let the build become slow. 加快构建速度</a></li>
<li><a href="#sec-6">6. Cross-functional teams FTW. 能力交叉团队更高效</a></li>
<li><a href="#sec-7">7. Trello does not scale well as a bug or project management tool. 工具定制化是不可避免的</a></li>
<li><a href="#sec-8">8. Take on responsibility or wither away. 承担责任</a></li>
<li><a href="#sec-9">9. Adapt or leave&#x2026; or fight if you need to. 适应，离开，或者是反抗</a></li>
<li><a href="#sec-10">10. Look for benefits that actually matter. 关注最核心的利益</a></li>
<li><a href="#sec-11">11. The CEO should be able to take a vacation. CEO休假离开时公司依然可以运转</a></li>
<li><a href="#sec-12">12. You need a strategy for real-time messaging. 不是所有事情都适合RTM</a></li>
<li><a href="#sec-13">13. You (can) influence how people perceive you - at first. 初次见面的印象</a></li>
<li><a href="#sec-14">14. Balance senior and junior people. 老少配最平衡</a></li>
<li><a href="#sec-15">15. Always have a visual mock before you start coding. 在开发之前要有visual mock.</a></li>
<li><a href="#sec-16">16. One office per team. 一个team一个office.</a></li>
<li><a href="#sec-17">17. Extroverts dominate every discussion, unless mitigated. 让内向的人也发言</a></li>
<li><a href="#sec-18">18. Developers need to talk about their shared mindset. 统一思想打硬仗</a></li>
<li><a href="#sec-19">19. Regular status updates are motivating. 定期同步状态</a></li>
<li><a href="#sec-20">20. Learning budget needs to be measured in time, not money. 给予开发者学习时间</a></li>
<li><a href="#sec-21">21. Pair programming is underrated. 结对编程</a></li>
<li><a href="#sec-22">22. Features get stuck without a proper release process. 具体事情落实到具体某个人</a></li>
<li><a href="#sec-23">23. Great things happen when there is autonomy. 给予开发者自主性</a></li>
<li><a href="#sec-24">24. When you want a message to stick, say it again and again. 如果某个信息很重要，那么不断重复它</a></li>
<li><a href="#sec-25">25. Hacks are a big part of startup culture. Hack是创业文化很大一部分</a></li>
<li><a href="#sec-26">26. Deadlines are stupid. Deadline是个糟糕的想法？</a></li>
</ul>
</div>
</div>
<p>
<a href="https://blog.stephanbehnke.com/26-lessons-from-being-a-developer-at-a-startup/">https://blog.stephanbehnke.com/26-lessons-from-being-a-developer-at-a-startup/</a>
</p>

<p>
作为创业公司的开发者学到的26点，整理的非常棒
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Retrospectives are crucial. 定期回顾</h2>
<div class="outline-text-2" id="text-1">
<p>
在讨论之前，每个人都需要先说说自己的看法，避免被"loudest"声音所淹没。
</p>

<p>
We regularly sat together as a team to reflect on the last iteration. The importance of looking back and evaluating cannot be overstated. Each participant was required to think about the things that went well and things that need improvement on their own first. The group discussion started only after everyone had presented their thoughts. This way, everyone was able to bring up important issues - much better than the kind of meetings where the 'loudest' dominate the conversation.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Take the time for regular 1:1s. 定期1:1</h2>
<div class="outline-text-2" id="text-2">
<p>
In a busy startup environment it might be hard to justify just talking to your manager for an hour each week. But that is what we did and it worked brilliantly. You can discuss issues in-depth, timely and simply feel more valued as an employee. There is no replacement for that.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Just pay for developer tools. 乐于为开发工具花钱</h2>
<div class="outline-text-2" id="text-3">
<p>
体现对开发人员的重视
</p>

<p>
For computers, every GB or MHz contributes to being able to work faster. For software, every useful tool that makes you more efficient counts. Giving the developer a fast, modern toolset also shows that the company values him/her. There should be no discussion about that. Period.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Meet your customers. 见见客户</h2>
<div class="outline-text-2" id="text-4">
<p>
We visited our local customers regularly and had an annual company trip to customer hot spots (New York and San Francisco, for example). This made all the difference. It is one thing to exchange emails with customers, but it is a completely different experience to meet them and hear their pains and successes first hand. It has a powerful and lasting effect on the way you think about your users when you are back developing.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Don't let the build become slow. 加快构建速度</h2>
<div class="outline-text-2" id="text-5">
<p>
加快构建速度可以提高反馈速度，提高开发效率。
</p>

<p>
You know you have acted too late when the slow build becomes a running gag in the office (XKCD anyone?). There is hardly anything more frustrating than having a slow feedback cycle. We have worked with Java in the backend and Webpack in the frontend. Both were getting slower and slower by the week. In the end, it made me want to smash my head against the wall. In the long run, slow builds cannot be fixed by buying faster machines. You need to think about the structure of your application to deal with it; modularising it, for example. There is no quick fix.
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Cross-functional teams FTW. 能力交叉团队更高效</h2>
<div class="outline-text-2" id="text-6">
<p>
把不同能力的人放在一起组成团队，的确能产生许多想象不到的效果。
</p>

<p>
Before we had formed cross-functional teams, we were only able to effectively tackle small projects. Once we had a team consisting of designer plus frontend and backend developer, things took off. It allowed us to work on much bigger, more impactful features. It brought its own set of challenges but overall it was a crucial step in the evolution of the startup.
</p>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Trello does not scale well as a bug or project management tool. 工具定制化是不可避免的</h2>
<div class="outline-text-2" id="text-7">
<p>
We have used Trello to manage our bugs. I love Trello but I always felt it fell short. It was difficult to search and only scaled up to a certain point. The same goes for project management. At a certain point the simplicity and ease of use fade away and it just becomes too overwhelming and ineffective. I prefer dedicated tools that actually support and facilitate what you are trying to achieve.
</p>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Take on responsibility or wither away. 承担责任</h2>
<div class="outline-text-2" id="text-8">
<p>
最后一句看上去有点像我现在的处境
</p>

<p>
To be successful at any company you need to take on responsibilities. The bigger the better. The difference to a corporate environment is that it is quite easy to do so: roles are not set in stone and it is easy to grab unclaimed or unwanted responsibilities. You must become the guy/gal for something to improve your standing. You need to be proactive and shape your own image - or others will do it for you. Bonus points if you align this with the company goals. <b>You can be a great code architect - but when the company only values feature development, you are betting on the wrong horse.</b>
</p>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Adapt or leave&#x2026; or fight if you need to. 适应，离开，或者是反抗</h2>
<div class="outline-text-2" id="text-9">
<p>
You might disagree with your management on certain things. In that case, you need to decide how important these issues are to you. If it is very important, you can take on the challenge and fight to stand up for what you believe is right. But often it will be an uphill battle. If hardly anyone around you supports you, or worse, does not even share your views, then you need to ask yourself if it is worth it. You can either ignore it and play along or look for another job.
</p>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Look for benefits that actually matter. 关注最核心的利益</h2>
<div class="outline-text-2" id="text-10">
<p>
公司的福利不是最核心的利益，公司的快速成长才是。当然每个人是有自己的情况的，要尊重差别。
</p>

<p>
A lot of startups boast with heaps of benefits. Some take pride in their ping pong tables, some want to impress with an open bar on Friday nights and some show off their selection of high-fructose corn syrup candy. It's a trap! Look for meaningful benefits like lunch and learns, an education budget or health benefits.
</p>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> The CEO should be able to take a vacation. CEO休假离开时公司依然可以运转</h2>
<div class="outline-text-2" id="text-11">
<p>
整个公司指望一个或者是几个人的话，是非常危险的。
</p>

<p>
When a startup is growing, the CEO has to give up more and more responsibilities since a single person cannot scale along with it. Basically, the CEO has to replace himself/herself step by step. A good indicator if this is working out is him/her deciding to go on a vacation.
</p>
</div>
</div>
