src/26-lessons-from-being-a-developer-at-a-startup.org
** You need a strategy for real-time messaging. 不是所有事情都适合RTM

We used Slack and while it was fun at times, I think it killed a lot of the productivity. We did not have a shared mindset about how the tool should be used. It is very important to clearly define what should end up in a chat and what is better left to email, face-to-face conversations or the wiki.

** You (can) influence how people perceive you - at first. 初次见面的印象
如果你希望同事怎么看你，那么最好一开始就塑造好形象，否则印象一旦形成就很难改变。

Whatever you say and do will shape how others perceive you. If you work weekends, you will become 'the workaholic'. If you come up with new features, you might become 'the wonder child'. And the thing is: it sticks. Often, the early impressions are the most important. It becomes increasingly harder to change how you are perceived by people around you.

** Balance senior and junior people. 老少配最平衡

In the backend, we almost only had senior developers with a combined number of 55+ years of experience. But to my surprise, this led to a plethora of discussions that rarely yielded great results. Those discussions were fierce. Sometimes I wondered whether everyone would make it out alive. On the other hand, in the frontend everyone was junior level. They displayed a lot of enthusiasm and creativity which - while meaning well - would often miss the bigger picture and lack high-level best practices. The key is the right mix of junior and senior people.

** Always have a visual mock before you start coding. 在开发之前要有visual mock.
在开发之前，消除误解，明确开发目标，以及设定正确预期。

A new feature has many stakeholders. There is the project manager, the designer, the product owner, the CEO, the developer and the customer, for example. All of them have their own expectations and agenda. The best way to communicate the vision for a new feature seems to be a visual representation as close as possible to the final result. Again and again this has helped us preventing misunderstandings and bringing everyone on the same page.

** One office per team. 一个team一个office.

It has been shown again, again, again, again, again, again, again and again that an open-plan office is a bad idea. I think a company usually wants to save money on office rent and sells it as a collaboration and creativity heaven. From experience I can tell you that you need a quiet environment to get work done - but you still need to be able to communicate easily with your team mates. I found the 'one office per team' rule strikes a good balance, if you keep teams small.

** Extroverts dominate every discussion, unless mitigated. 让内向的人也发言

For an introverted person like me, the workplace can be challenging. Extroverts like to talk and write - a lot. Introverts usually cannot compete. We are at a serious disadvantage since extroverts can respond quicker, more confidently and more elaborately. Any company that does not address this issue loses out on great ideas and contributions by its 'silent minority'.

** Developers need to talk about their shared mindset. 统一思想打硬仗
团队可能每个人的思维差异很大，如果这些思维没有办法统一起来的话，或者至少在某些方面存在共识的话，那么很难协调好团队。这些思想需要体现在开发活动中，比如code review, coding style, development culture等等。

Once you go from a single developer to a team of developers, there will be conflicts. Everyone is different. That is why it is so important to share a common mindset about things like code style, architecture, development and bug process, code reviews and so on. Simply writing down rules in a wiki does not work. It needs to be lived, understood and changed when circumstances require it. There is no substitute for regularly talking about it.

** Regular status updates are motivating. 定期同步状态

Knowing that, at the next day's standup my entire team will listen to what I have worked on motivated me. Even more so for weekly status updates. When our startup was still small, everyone shared last week's successes and failures in a few words. When the company grew bigger and only the team's joint efforts were presented, it was not as motivating anymore.

** Learning budget needs to be measured in time, not money. 给予开发者学习时间

Although we have had a learning budget, it was hardly ever used for something other than attending conferences. Workshops can be a hit or miss - often there is not even one for the latest technologies. But like many of my colleagues, I am able to learn new things from blogs, books and videos just fine. So I propose to allow developers to invest a few dedicated days a year to learn things on their own. It is what we have to do anyway - often on weekends - but this way the company can support these efforts directly.

** Pair programming is underrated. 结对编程

A nice tool to share knowledge across team members or even across teams is pair programming. Personally, I find it more effective than reviews. The interactions and discussions during coding are invaluable. How good it works often depends on how well the two developers can get along - from experience I can say that putting together very different people can actually yield the best results, though.

** Features get stuck without a proper release process. 具体事情落实到具体某个人

This one might seem obvious but can easily be missed. I have witnessed features stuck in limbo for months because nobody really knew how to progress with a finished feature sitting in a branch. It is paramount to have a clear understanding about who has which responsibilities or, even better, have someone who's job it is to take care of that.

** Great things happen when there is autonomy. 给予开发者自主性

Giving developers the opportunity to work on things on the side can become a powerful source for innovation. When a company supports this natural drive excellent developers have, great things happen. If it does not, the most dedicated developers will make their own opportunities anyway (e.g. working overtime or weekends) which can lead to unhappiness or even burnout in the long run.

** When you want a message to stick, say it again and again. 如果某个信息很重要，那么不断重复它

You have an important message you want everyone to understand, share and remember. You cannot just say it once. Or just put it on a slide, in bold letters. You need to repeat it, again and again. It needs to be crystal clear. There should be no doubt about what you say. For further advice read the excellent book Make it Stick.

