src/26-lessons-from-being-a-developer-at-a-startup.org
** Hacks are a big part of startup culture. Hack是创业文化很大一部分
Hack是necessary evil的，但是不要过度使用它。

A startup always has more things to do than resources to do it. Prioritization is essential. And this often means to quickly hack together a solution that barely works. Sometimes for good reasons, like prototyping a feature and seeing if it sticks. But if it does, you rarely have the time to go back and make it better. However, what I have always found very irritating was how much a hack can be celebrated. It always felt like cheating to me. But I have come to terms with it: Hacks are a necessary evil at any startup. Just don't overdo it, please.

** Deadlines are stupid. Deadline是个糟糕的想法？
不顾一切地为了meet deadline的确是很糟糕的想法。

In today's ever changing world, a deadline is an artifact of the past. Deadlines only make a manager feel good, but kill everything that is good about software development. The further the deadline is a way, the more ridiculous and dangerous it becomes. The only thing that is worse are deadlines plus a set of requirements. This brings us back to the ancient beginnings of software development. There is no place for deadlines in the future.
